[
  {
    "id": "670c0a34bf94c1d3906bb7ae",
    "name": "Garuda Construction and Engineering",
    "slug": "garuda-construction-and-engineering",
    "about": "Garuda Construction and Engineering Limited was incorporated on 21st day of September, 2010, and is a fast-emerging civil construction company undertaking comprehensive construction services in residential, commercial, industrial, and infrastructure projects. Garuda has established itself as a quality and innovative trailblazer and earned a good name in the industry.The company specializes in the construction of concrete and steel structures that are not only strong but also durable, offering customers a total solution with MEP solutions. Garuda is proud to be offering its services-from conceptual design to actual project completion-to ensure that all projects meet its commitment to excellence.Renowned for its expertise in hospitality development, Garuda consistently delivers projects that not only meet but exceed client expectations. The firm also offers comprehensive operations and maintenance services, ensuring the sustainability and long-term performance of every structure built.Garuda’s mission is to drive the future of urban development by creating sustainable, innovative, and beautifully designed structures. With a focus on efficiency, client satisfaction, and the use of top-quality materials, Garuda is committed to enhancing urban landscapes with state-of-the-art construction that reflects its core values of social responsibility and design excellence.",
    "logo": "https://media.ipoji.com/ipo/Garuda_Logo.png",
    "contact_info": {
      "address": "201, A Wing, Fortune 2000 C -3 Block, Bandra Kurla Complex, Bandra (East), Mumbai 400 051",
      "phone": "+91 22 79635174",
      "email": "compliance@garudaconstructionengineering.com",
      "website": "https://garudaconstructionengineering.com/"
    },
    "promoters": [
      "Pravinkumar Brijendra Kumar Agarwal",
      "PKH Ventures Limited",
      "Makindian Township Private Limited"
    ],
    "strengths": [
      "The company maintains high construction quality and timely delivery through its strong project management capacity, utilizing a fleet of modern construction equipment managed through third-party vendors to remain asset-light.",
      "As of the latest report, Garuda's order book stood at ₹1,40,827.44 lakhs, indicating strong future revenue potential from ongoing and upcoming projects across various regions.",
      "Asset Management and Cost Efficiency: By employing third-party vendors for equipment, Garuda strategically keeps its asset base light, which enhances cost efficiency and minimizes operational disruptions, contributing to its financial stability."
    ],
    "weaknesses": [
      "Garuda Construction has experienced negative cash flows from operations in recent periods, totalling (-₹192.64 lakhs) as of November 30, 2023, which could hinder financial stability and operations.",
      "Venturing into new markets with 64.61% of ongoing projects with unrelated entities exposes Garuda to risks of non-performance, project delays, and potential financial losses."
    ],
    "financials": [
      {
        "period": "2022-03-30T00:00:00.000Z",
        "revenue": 77.03,
        "assets": 111.03,
        "profit": 18.78
      },
      {
        "period": "2023-03-30T00:00:00.000Z",
        "revenue": 161.02,
        "assets": 176.35,
        "profit": 40.8
      },
      {
        "period": "2024-03-30T00:00:00.000Z",
        "revenue": 154.47,
        "assets": 228.49,
        "profit": 36.44
      }
    ],
    "created_at": "2024-10-13T17:58:12.300Z",
    "updated_at": "2024-10-13T17:58:12.300Z"
  }
]
